sentervip/stm32f105rbCAN4550/demo/TCAN4550Test/CAN/User/tcan4x5x/TCAN4x5x_Data_Structs.h
            //! @brief IR[18] TOO: Time out occurred
            uint8_t TOO : 1;

            //! @brief IR[19] DRX: Message stored to dedicated RX buffer
            uint8_t DRX : 1;

            //! @brief IR[20] BEC: MRAM Bit error corrected
            uint8_t BEC : 1;

            //! @brief IR[21] BEU: MRAM Bit error uncorrected
            uint8_t BEU : 1;

            //! @brief IR[22] ELO: Error logging overflow
            uint8_t ELO : 1;

            //! @brief IR[23] EP: Error_passive status changed
            uint8_t EP : 1;

            //! @brief IR[24] EW: Error_warning status changed
            uint8_t EW : 1;

            //! @brief IR[25] BO: Bus_off status changed
            uint8_t BO : 1;

            //! @brief IR[26] WDI: MRAM Watchdog Interrupt
            uint8_t WDI : 1;

            //! @brief IR[27] PEA Protocol Error in arbitration phase (nominal bit time used)
            uint8_t PEA : 1;

            //! @brief IR[28] PED: Protocol error in data phase (data bit time is used)
            uint8_t PED : 1;

            //! @brief IR[29] ARA: Access to reserved address
            uint8_t ARA : 1;

            //! @brief IR[30:31] Reserved, not writable
            uint8_t reserved : 2;
        };
    };
} TCAN4x5x_MCAN_Interrupts;


/**
 * @brief Struct containing the MCAN interrupt enable bit field
 */
typedef struct
{
    union
    {
        //! Full register as single 32-bit word
        uint32_t word;
        struct
        {
            //! @brief IE[0] RF0NE: Rx FIFO 0 new message
            uint8_t RF0NE : 1;

            //! @brief IE[1] RF0WE: Rx FIFO 0 watermark reached
            uint8_t RF0WE : 1;

            //! @brief IE[2] RF0FE: Rx FIFO 0 full
            uint8_t RF0FE : 1;

            //! @brief IE[3] RF0LE: Rx FIFO 0 message lost
            uint8_t RF0LE : 1;

            //! @brief IE[4] RF1NE: Rx FIFO 1 new message
            uint8_t RF1NE : 1;

            //! @brief IE[5]  RF1WE: RX FIFO 1 watermark reached
            uint8_t RF1WE : 1;

            //! @brief IE[6] RF1FE: Rx FIFO 1 full
            uint8_t RF1FE : 1;

            //! @brief IE[7] RF1LE: Rx FIFO 1 message lost
            uint8_t RF1LE : 1;

            //! @brief IE[8] HPME: High priority message
            uint8_t HPME : 1;

            //! @brief IE[9] TCE: Transmission completed
            uint8_t TCE : 1;

            //! @brief IE[10] TCFE: Transmission cancellation finished
            uint8_t TCFE : 1;

            //! @brief IE[11] TFEE: Tx FIFO Empty
            uint8_t TFEE : 1;

            //! @brief IE[12] TEFNE: Tx Event FIFO new entry
            uint8_t TEFNE : 1;

            //! @brief IE[13] TEFWE: Tx Event FIFO watermark reached
            uint8_t TEFWE : 1;

            //! @brief IE[14] TEFFE: Tx Event FIFO full
            uint8_t TEFFE : 1;

            //! @brief IE[15] TEFLE: Tx Event FIFO element lost
            uint8_t TEFLE : 1;

            //! @brief IE[16] TSWE: Timestamp wraparound
            uint8_t TSWE : 1;

            //! @brief IE[17] MRAFE: Message RAM access failure
            uint8_t MRAFE : 1;

            //! @brief IE[18] TOOE: Time out occured
            uint8_t TOOE : 1;

            //! @brief IE[19] DRXE: Message stored to dedicated RX buffer
            uint8_t DRXE : 1;

            //! @brief IE[20] BECE: MRAM Bit error corrected
            uint8_t BECE : 1;

            //! @brief IE[21] BEUE: MRAM Bit error uncorrected
            uint8_t BEUE : 1;

            //! @brief IE[22] ELOE: Error logging overflow
            uint8_t ELOE : 1;

            //! @brief IE[23] EPE: Error_passive status changed
            uint8_t EPE : 1;

            //! @brief IE[24] EWE: Error_warning status changed
            uint8_t EWE : 1;

            //! @brief IE[25] BOE: Bus_off status changed
            uint8_t BOE : 1;

            //! @brief IE[26] WDIE: MRAM Watchdog Interrupt
            uint8_t WDIE : 1;

            //! @brief IE[27] PEAE Protocol Error in arbitration phase (nominal bit time used)
            uint8_t PEAE : 1;

            //! @brief IE[28] PEDE: Protocol error in data phase (data bit time is used)
            uint8_t PEDE : 1;

            //! @brief IE[29] ARAE: Access to reserved address
            uint8_t ARAE : 1;

            //! @brief IE[30:31] Reserved, not writable
            uint8_t reserved : 2;
        };
    };
} TCAN4x5x_MCAN_Interrupt_Enable;


/**
 * @brief CAN message header
 */
typedef struct
{
    //! @brief CAN ID received
    uint32_t ID : 29;

    //! @brief Remote Transmission Request flag
    uint8_t RTR : 1;

    //! @brief Extended Identifier flag
    uint8_t XTD : 1;

    //! @brief Error state indicator flag
    uint8_t ESI : 1;

    //! @brief Receive time stamp
    uint16_t RXTS : 16;

    //! @brief Data length code
    uint8_t DLC : 4;

    //! @brief Bit rate switch used flag
    uint8_t BRS : 1;

    //! @brief CAN FD Format flag
    uint8_t FDF : 1;

    //! @brief Reserved (0)
    uint8_t reserved : 2;

    //! @brief Filter index that this message matched
    uint8_t FIDX : 7;

    //! @brief Accepted non matching frame flag
    uint8_t ANMF : 1;

} TCAN4x5x_MCAN_RX_Header ;


/**
 * @brief CAN message header for transmitted messages
 */
typedef struct
{
   //! @brief CAN ID to send
    uint32_t ID : 29;

   //! @brief Remote Transmission Request flag
    uint8_t RTR : 1;

   //! @brief Extended Identifier flag
    uint8_t XTD : 1;

   //! @brief Error state indicator flag
    uint8_t ESI : 1;

   //! @brief Data length code
    uint8_t DLC : 4;

   //! @brief Bit rate switch used flag
    uint8_t BRS : 1;

   //! @brief CAN FD Format flag
    uint8_t FDF : 1;

   //! @brief Reserved
    uint8_t reserved : 1;

   //! @brief Event FIFO Control flag, to store tx events or not
    uint8_t EFC : 1;

   //! @brief Message Marker, used if @c EFC is set to 1
    uint8_t MM : 8;

} TCAN4x5x_MCAN_TX_Header;


typedef enum
{
    //! Disabled filter. This filter will do nothing if it matches a packet
    TCAN4x5x_SID_SFEC_DISABLED          = 0x0,

    //! Store in RX FIFO 0 if the filter matches the incoming message
    TCAN4x5x_SID_SFEC_STORERX0          = 0x1,

    //! Store in RX FIFO 1 if the filter matches the incoming message
    TCAN4x5x_SID_SFEC_STORERX1          = 0x2,

