sentervip/stm32f105rbCAN4550/demo/TCAN4550Test/CAN/User/tcan4x5x/TCAN4x5x_Data_Structs.h
    //! Reject the packet (do not store, do not notify MCU) if the filter matches the incoming message
    TCAN4x5x_SID_SFEC_REJECTMATCH       = 0x3,

    //! Store in default location but set a high priority message interrupt if the filter matches the incoming message
    TCAN4x5x_SID_SFEC_PRIORITY          = 0x4,

    //! Store in RX FIFO 0 and set a high priority message interrupt if the filter matches the incoming message
    TCAN4x5x_SID_SFEC_PRIORITYSTORERX0  = 0x5,

    //! Store in RX FIFO 1 and set a high priority message interrupt if the filter matches the incoming message
    TCAN4x5x_SID_SFEC_PRIORITYSTORERX1  = 0x6,

    //! Store in RX Buffer for debug if the filter matches the incoming message. SFT is ignored if this is selected.
    TCAN4x5x_SID_SFEC_STORERXBUFORDEBUG = 0x7
} TCAN4x5x_SID_SFEC_Values;

typedef enum
{
    //! Disabled filter. This filter will match nothing
    TCAN4x5x_SID_SFT_DISABLED           = 0x3,

    //! Classic filter with SFID1 as the ID to match, and SFID2 as the bit mask that applies to SFID1
    TCAN4x5x_SID_SFT_CLASSIC            = 0x2,

    //! Dual ID filter, where both SFID1 and SFID2 hold IDs that can match (must match exactly)
    TCAN4x5x_SID_SFT_DUALID             = 0x1,

    //! Range Filter. SFID1 holds the start address, and SFID2 holds the end address. Any address in between will match
    TCAN4x5x_SID_SFT_RANGE              = 0x0
} TCAN4x5x_SID_SFT_Values;


/**
 * @brief Standard ID filter struct
 */
typedef struct
{
    union
    {
        //! full register as single 32-bit word
        uint32_t word;

        struct
        {
            //! @brief SFID2[10:0]
            uint16_t SFID2 : 11;

            //! @brief Reserved
            uint8_t reserved : 5;

            //! @brief SFID1[10:0]
            uint16_t SFID1 : 11;

            //! @brief SFEC[2:0]   Standard filter element configuration
            TCAN4x5x_SID_SFEC_Values SFEC : 3;

            //! @brief SFT Standard Filter Type
            TCAN4x5x_SID_SFT_Values SFT : 2;
        };
    };
} TCAN4x5x_MCAN_SID_Filter;



typedef enum
{
    //! Disabled filter. This filter will do nothing if it matches a packet
    TCAN4x5x_XID_EFEC_DISABLED          = 0x0,

    //! Store in RX FIFO 0 if the filter matches the incoming message
    TCAN4x5x_XID_EFEC_STORERX0          = 0x1,

    //! Store in RX FIFO 1 if the filter matches the incoming message
    TCAN4x5x_XID_EFEC_STORERX1          = 0x2,

    //! Reject the packet (do not store, do not notify MCU) if the filter matches the incoming message
    TCAN4x5x_XID_EFEC_REJECTMATCH       = 0x3,

    //! Store in default location but set a high priority message interrupt if the filter matches the incoming message
    TCAN4x5x_XID_EFEC_PRIORITY          = 0x4,

    //! Store in RX FIFO 0 and set a high priority message interrupt if the filter matches the incoming message
    TCAN4x5x_XID_EFEC_PRIORITYSTORERX0  = 0x5,

    //! Store in RX FIFO 1 and set a high priority message interrupt if the filter matches the incoming message
    TCAN4x5x_XID_EFEC_PRIORITYSTORERX1  = 0x6,

    //! Store in RX Buffer for debug if the filter matches the incoming message.
    TCAN4x5x_XID_EFEC_STORERXBUFORDEBUG = 0x7
} TCAN4x5x_XID_EFEC_Values;

typedef enum
{
    //! Range filter from EFID1 to EFID2, The XIDAM mask is not applied
    TCAN4x5x_XID_EFT_RANGENOMASK        = 0x3,

    //! Classic Filter, EFID1 is the ID/filter, and EFID2 is the mask
    TCAN4x5x_XID_EFT_CLASSIC            = 0x2,

    //! Dual ID filter matches if the incoming ID matches EFID1 or EFID2
    TCAN4x5x_XID_EFT_DUALID             = 0x1,

    //! Range filter from EFID1 to EFID2
    TCAN4x5x_XID_EFT_RANGE              = 0x0
} TCAN4x5x_XID_EFT_Values;


/**
 * @brief Extended ID filter struct
 */
typedef struct
{

    //! @brief EFID2[28:0]
    uint32_t EFID2 : 29;

    //! @brief Reserved
    uint8_t reserved : 1;

    //! @brief EFT[1:0]
    TCAN4x5x_XID_EFT_Values EFT : 2;

    //! EFID1[28:0]
    uint32_t EFID1 : 29;

    //! @brief SFT Standard Filter Type
    TCAN4x5x_XID_EFEC_Values EFEC : 3;
} TCAN4x5x_MCAN_XID_Filter;


typedef enum {
    TCAN4x5x_GFC_ACCEPT_INTO_RXFIFO0 = 0,
    TCAN4x5x_GFC_ACCEPT_INTO_RXFIFO1 = 1,
    TCAN4x5x_GFC_REJECT = 2
} TCAN4x5x_GFC_NO_MATCH_BEHAVIOR;

/**
 * @brief Struct containing the register values for the Global Filter Configuration Register
 */
typedef struct
{
    union
    {
        //! Full word of register
        uint32_t word;

        struct {
            //! @brief GFC[0] :  Reject Remote Frames for Extended IDs
            uint8_t RRFE : 1;

            //! @brief GFC[1] :  Reject Remote Frames for Standard IDs
            uint8_t RRFS : 1;

            //! @brief GFC[3:2] :  Accept Non-matching Frames Extended
            //! Valid values:
            //! TCAN4x5x_GFC_ACCEPT_INTO_RXFIFO0 : Accept into RXFIFO0
            //! TCAN4x5x_GFC_ACCEPT_INTO_RXFIFO1 : Accept into RXFIFO1
            //! TCAN4x5x_GFC_REJECT              : Reject
            TCAN4x5x_GFC_NO_MATCH_BEHAVIOR ANFE : 2;

            //! @brief GFC[5:4] :  Accept Non-matching Frames Standard
            //! Valid values:
            //! TCAN4x5x_GFC_ACCEPT_INTO_RXFIFO0 : Accept into RXFIFO0
            //! TCAN4x5x_GFC_ACCEPT_INTO_RXFIFO1 : Accept into RXFIFO1
            //! TCAN4x5x_GFC_REJECT              : Reject
            TCAN4x5x_GFC_NO_MATCH_BEHAVIOR ANFS : 2;

            //! @brief Reserved
            uint32_t reserved : 26;
        };
    };
} TCAN4x5x_MCAN_Global_Filter_Configuration;



// ~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*
//                        TCAN4x5x Device Structures
// ~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*


/**
 * @brief Struct containing the device interrupt bit field
 */
typedef struct
{
    union
    {
        //! Full register as single 32-bit word
        uint32_t word;

        struct
        {
            //! @brief DEV_IR[0] VTWD: Global Voltage, Temp, or Watchdog (if equipped) Interrupt
            uint8_t VTWD : 1;

            //! @brief DEV_IR[1] M_CAN_INT: There are MCAN interrupts pending
            uint8_t M_CAN_INT : 1;

            //! @brief DEV_IR[2] : Selective Wake Error (If equipped)
            uint8_t SWERR : 1;

